import 'package:flutter/material.dart';
import 'package:flutter_widget_from_html/flutter_widget_from_html.dart';

class TermsScreen extends StatelessWidget {
  const TermsScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text("الشروط و سياسة الخصوصية"),
      ),
      body: const Padding(
        padding: EdgeInsets.all(20.0),
        child: SingleChildScrollView(
          child: HtmlWidget(
            """
<!DOCTYPE html>
<html lang="en" dir="rtl">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <title>الشروط و الأحكام</title>
  </head>
  <body>
    <h1>الشروط و الأحكام</h1>
    <h4>أولاً التعريف بالتطبيق :</h4>
    <p>
      - <span>الطرف الأول تطبيق شريك :</span> شريك هو تطبيق إعلاني سعودي جديد
      بخدمات جديدة ومتميزة، مختص في جمع الشركاء في عدة مجالات مختلفة مع الأشخاص
      الأنسب لموقعك واهتمامك.
    </p>
    <div>ابرز خدمات المنصة :</div>
    <ul>
      <li>
        <span>شريك أعمال :</span> وهو الشراكة والبيع في جميع انواع الأراضي
        والعقارات والمشاريع التجارية والتقنية.
      </li>
      <li>
        <span>شريك ذبيحتي : </span>وهو الشراكة والبيع في جميع أنواع الذبائح
        والمواشي.
      </li>
      <li>
        <span>شريك رحلتي :</span> وهو الشراكة في الرحلات الداخلية للتنقل ونقل
        الطرود عبر المناطق والمدن السعودية.
      </li>
      <li>
        <span>شريك سكني : </span> وهو تأجير الشقق والشراكة في السكن التشاركي مع
        الأشخاص من هم من نفس ال جنس
      </li>
    </ul>

    <p>
      - الطرف الثاني المستخدم : هو منشئ الحساب على تطبيق شريك لغرض البحث عن
      الشراكة و التواصل أو التصفح أو نشر وبيع منتجاته أو خدماته عبر التطبيق
    </p>
    <h4>ثانياً اتفاقية الإستخدام و الإعلان :</h4>
    <p>
      على مستفيد ومستخدم تطبيق شريك وهو ( الطرف الثاني ) الالتزام بالشروط الاتية
      :
    </p>
    <ul>
      <li>عدم الإعلان أو تحميل محتوى أو عناصر غير ملائمة.</li>
      <li>
        عدم التلاعب بأسعار السلع سواء في البيع او الشراء وإلحاق الضرر بالآخرين.
      </li>
      <li>
        عدم تقديم بلاغاً كيدياُ على أي مستخدم او تقوم بتقييم غير منصف لأي
        مستخدم.
      </li>
      <li>عدم تقديم معلومات غير صحيحة اثناء رفع طلب إعلاني على التطبيق.</li>
      <li>
        عدم الاختراق أو التحايل على قوانين وسياسة وأنظمة التطبيق أو أي حقوق
        تتعلق بطرف ثالث.
      </li>
      <li>
        عدم استخدام أي وسيلة غير شرعية للوصول للإعلانات أو لبيانات المستخدمين
        الآخرين أو انتهاك لسياسة وحقوق تطبيق شريك ، أو الوصول لمحتوى الموقع أو
        تجميع وتحصيل معلومات وبيانات تخص تطبيق شريك أو عملاء الموقع والاستفادة
        منها بأي شكل من الأشكال أو إعادة نشرها.
      </li>
      <li>
        عدم التلاعب أو الاحتيال في البيع أو الشراء أو الاستثمار أو الشراكة
        بالمستخدمين الآخرين أو الأطراف الأخرى وإلحاق الضرر بهم.
      </li>
      <li>عدم انتهاك حقوق الآخرين الملكية أو الفكرية أو براءة الاختراع.</li>
      <li>
        عدم جمع معلومات عن مستخدمي الموقع الآخرين لأغراض تجارية أو شخصية أو
        غيرها.
      </li>
      <li>يحق تطبيق شريك حذف وإلغاء حسابك في حال وجود أي تجاوز.</li>
      <li>
        يلزم المستخدم المسجل في شريك أنه الوحيد الذي يستخدم الحساب ويكون مسؤولا
        عن كل ما يتم عبر حسابه، ولا يسمح استخدام اكثر من حساب لغرض التحايل او
        إخفاء الهوية.
      </li>
      <li>
        يجب أن يكون اسم المستخدم اسم له معنى وليس مجرد رموز أو أرقام ويمنع
        استخدام أي أسماء تحرض على الكراهية والعنف أو استخدام أي من العلامات
        التجارية او أسماء لأشخاص اخرين كاسم للمستخدم.
      </li>
      <li>
        عدم استخدام خدماتنا إذا كنت غير مؤهل قانونيا لإتمام هذه الاتفاقية. على
        سبيل المثال أنك أقل من 18 سنة أو أنك محجوب بشكل مؤقت أو دائم من استخدام
        الموقع.
      </li>
      <li>
        عدم الإعلان عن كل ما يعرضك للحصول على مخالفة من قبل الجهات المختصة.
      </li>
      <li>عدم انتهاك أنظمة حقوق الإنسان أو أنظمة حماية الحياة الفطرية.</li>
      <li>
        ( لا يعتبر الطرف الأول ) تطبيق شريك طرفاً في أي علاقة تعاقدية بين
        الشركاء وتعتبر صفحة إعلانية مستقلة .
      </li>
    </ul>
    <h4>ثالثاً سياسية الخصوصية :</h4>
    <ul>
      <li>
        إن بيانات التسجيل والمعلومات الأخرى التي تتعلق بك تندرج تحت هام وسري
        للغاية، كما انها تندرج تحت سياسة الخصوصية التي يتبعها تطبيق شريك. ولن
        تستخدم تلك البيانات او المعلومات إلا بالطريقة الملائمة، ولن يتم نشرها او
        مشاركتها مع أي طرف اخر.
      </li>
      <li>
        يقدم تطبيق شريك خدمة تمكين المستخدم من عرض إعلانه وفق سياسة الاستخدام
        المتفق عليها ولا نقدم أي ضمانات ولا نتحمل أي مسؤولية في حالة عدم التزام
        المستخدم بسياسة استخدام الموقع ولا نتحمل المسؤولية عن أي مخاطرة أو أضرار
        أو تبعات أو خسائر تقع على البائع أو المشتري أو المستثمر أو الشريك أو
        المستخدم أو أي طرف آخر وعلى من لحق به الضر التوجه للجهات الأمنية.
      </li>
      <li>
        هذه السياسة محل تغيير دائم وتطوير، مع إشعار المستخدمين بذلك، وعلى
        المستخدمين مراجعة هذه السياسات بشكل دور ي وفوري.
      </li>
    </ul>
  </body>
</html>

""",
          ),
        ),
      ),
    );
  }
}
